Model: "E2E_1stage_v8_vl_0_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 16000)]           0         
_________________________________________________________________
speech_features (SpeechFeatu (None, 49, 40)            0         
_________________________________________________________________
svdf_1 (Svdf)                (None, 46, 128)           44416     
_________________________________________________________________
svdf_2 (Svdf)                (None, 37, 128)           68480     
_________________________________________________________________
svdf_3 (Svdf)                (None, 28, 128)           68480     
_________________________________________________________________
svdf_4 (Svdf)                (None, 19, 128)           68480     
_________________________________________________________________
svdf_5 (Svdf)                (None, 10, 128)           68480     
_________________________________________________________________
svdf_6 (Svdf)                (None, 1, 256)            35584     
_________________________________________________________________
stream (Stream)              (None, 256)               0         
_________________________________________________________________
dropout (Dropout)            (None, 256)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 16)                4112      
=================================================================
Total params: 358,032
Trainable params: 358,032
Non-trainable params: 0
_________________________________________________________________