Model: "keyword_marvin_v3_vl_0_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 16000)]           0         
_________________________________________________________________
speech_features (SpeechFeatu (None, 98, 40)            0         
_________________________________________________________________
svdf_1 (Svdf)                (None, 87, 32)            7172      
_________________________________________________________________
svdf_2 (Svdf)                (None, 76, 32)            6500      
_________________________________________________________________
svdf_3 (Svdf)                (None, 65, 32)            6500      
_________________________________________________________________
svdf_4 (Svdf)                (None, 34, 32)            2080      
_________________________________________________________________
svdf_5 (Svdf)                (None, 3, 32)             2080      
_________________________________________________________________
stream (Stream)              (None, 96)                0         
_________________________________________________________________
dropout (Dropout)            (None, 96)                0         
_________________________________________________________________
dense_8 (Dense)              (None, 3)                 291       
=================================================================
Total params: 24,623
Trainable params: 24,623
Non-trainable params: 0
_________________________________________________________________